# Data Analysis Warmup Exercises

In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 1. Show the Top 3 Rows of the Dataset

In [3]:
print(df1.head(3))

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## 2. Display the last 3 rows of the Dataset

In [4]:
print(df1.tail(3))

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Find the shape of the dataset (number of rows and columns)

In [5]:
print(df1.shape)
# 7 rows, 3 columns

(7, 3)

## 4. Get information about the dataset: total number of rows, total number of columns, datatypes of each column and memory requirement

In [6]:
print(df1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes
None

## 5. Check for Null values

In [7]:
print(df1.isnull().sum())

Name      0
Marks     0
Gender    0
dtype: int64

## 6. Get Overall Statistics of the Dataset

In [8]:
print(df1.describe(include='all'))

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## 7. Find Unique values from the Gender Column

In [9]:
print(df1['Gender'].unique())

['Male' 'Female']

## 8. Find the number of unique values from the Gender column

In [10]:
print(df1['Gender'].nunique())

2

## 9. Display the count of unique values in gender column

In [11]:
print(df1['Gender'].value_counts())

Gender
Female    4
Male      3
Name: count, dtype: int64

## 10. Find the total number of students having marks between 90 to 100 using BETWEEN method

In [12]:
df1[df1['Marks']>= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [13]:
df1[(df1['Marks']>= 90) & (df1['Marks'] <=100)]['Name']

0    Priyang
2     Krisha
4     Parshv
6    Archana
Name: Name, dtype: object

In [14]:
sum(df1['Marks'].between(90, 100))

4

## 11. Find Average Marks

In [15]:
df1['Marks'].mean()

np.float64(92.14285714285714)

## 12. Apply Method (use a particular method that we create and apply it to the data)

In [16]:
def marks(x):
    return x/2

In [17]:
df1['Half Marks']= df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

## 13. Map Function

In [18]:
df1['Male_Female'] = df1['Gender'].map({'Male': 1, 'Female': 0})
df1

      Name  Marks  Gender  Half Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

## 14. Drop the columns just created

In [21]:
df1 = df1.drop(['Male_Female','Half Marks'],axis=1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 15. Print the name of the columns

In [22]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [23]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## 16. Sort the dataframes as per the Marks Column

In [24]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## 17. Display the Name and Marks of Female Students

In [26]:
df1[df1['Gender']=='Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [27]:
df1[df1['Gender'].str.contains('female',case=False)][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [28]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99